In [1]:
#installing pandas

In [2]:
!pip install pandas

Defaulting to user installation because normal site-packages is not writeable
Requirement already satisfied: pandas in e:\softwares\anaconda\installation files\lib\site-packages (1.4.2)
Requirement already satisfied: pytz>=2020.1 in e:\softwares\anaconda\installation files\lib\site-packages (from pandas) (2021.3)
Requirement already satisfied: python-dateutil>=2.8.1 in e:\softwares\anaconda\installation files\lib\site-packages (from pandas) (2.8.2)
Requirement already satisfied: numpy>=1.18.5 in e:\softwares\anaconda\installation files\lib\site-packages (from pandas) (1.21.5)
Requirement already satisfied: six>=1.5 in e:\softwares\anaconda\installation files\lib\site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)

In [28]:
import pandas as pd

In [29]:
#first check data is clean or have null values??

In [30]:

# df = pd.read_csv('path')

# panda series

In [31]:
#panda series is like a column in a table

a = [1,7,2]
myvar = pd.Series(a)
print(myvar)

0    1
1    7
2    2
dtype: int64

In [32]:
#key value object as series
#here we have a dictionary
sample = {'day 1': 420, 'day 2': 380, 'day 3': 390 }
myvar = pd.Series(sample)
print(myvar)

day 1    420
day 2    380
day 3    390
dtype: int64

# dataframe

In [33]:
# 2 dimensional data structure

In [34]:
data = {
    "calories":[420,380,390],
    "duration":[50,40,45]
}
df = pd.DataFrame(data)
print(df)

   calories  duration
0       420        50
1       380        40
2       390        45

In [35]:
#how to locate any row

In [36]:
print(df.loc[0])

calories    420
duration     50
Name: 0, dtype: int64

In [37]:
sample_data = {
    "weekdays":['sunday','monday','tuesday'],
    "test_score" : [10,20,30]
    
}

df = pd.DataFrame(sample_data)

In [38]:
df

  weekdays  test_score
0   sunday          10
1   monday          20
2  tuesday          30

In [39]:
df.loc[0]

weekdays      sunday
test_score        10
Name: 0, dtype: object

# pandas read csv

In [48]:
# comma separated files

In [49]:
 # df = pd.read_csv('data.csv')
#  print(df)

In [71]:
df = pd.read_csv( 'airtravel.csv')

In [72]:
df

   Month   "1958"   "1959"   "1960"
0    JAN      340      360      417
1    FEB      318      342      391
2    MAR      362      406      419
3    APR      348      396      461
4    MAY      363      420      472
5    JUN      435      472      535
6    JUL      491      548      622
7    AUG      505      559      606
8    SEP      404      463      508
9    OCT      359      407      461
10   NOV      310      362      390
11   DEC      337      405      432

In [73]:
# analyzing data frame

In [75]:
print(df.head(10)) # to view top 10 rows

  Month   "1958"   "1959"   "1960"
0   JAN      340      360      417
1   FEB      318      342      391
2   MAR      362      406      419
3   APR      348      396      461
4   MAY      363      420      472
5   JUN      435      472      535
6   JUL      491      548      622
7   AUG      505      559      606
8   SEP      404      463      508
9   OCT      359      407      461

In [76]:
print(df.tail(5)) #last 5 rows

   Month   "1958"   "1959"   "1960"
7    AUG      505      559      606
8    SEP      404      463      508
9    OCT      359      407      461
10   NOV      310      362      390
11   DEC      337      405      432

In [78]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12 entries, 0 to 11
Data columns (total 4 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Month    12 non-null     object
 1    "1958"  12 non-null     int64
 2    "1959"  12 non-null     int64
 3    "1960"  12 non-null     int64
dtypes: int64(3), object(1)
memory usage: 512.0+ bytes
None

In [79]:
df.describe() #only work on numerical data #we get statstical values

           "1958"      "1959"      "1960"
count   12.000000   12.000000   12.000000
mean   381.000000  428.333333  476.166667
std     64.530472   69.830097   77.737125
min    310.000000  342.000000  390.000000
25%    339.250000  387.500000  418.500000
50%    360.500000  406.500000  461.000000
75%    411.750000  465.250000  514.750000
max    505.000000  559.000000  622.000000

In [83]:
#correlation of data
# relation among different column
#perfect +ve correlation will have a value of 1
#perfect -ve correlation will have a value of -1
#not correlated? somewhere around zero

In [81]:
df.corr()

           "1958"    "1959"    "1960"
 "1958"  1.000000  0.980656  0.976757
 "1959"  0.980656  1.000000  0.977292
 "1960"  0.976757  0.977292  1.000000